*---------------------------------------------------------------------*
*  Licensed Materials - Property of IBM                               *
*  CICS XFCREQ SAMPLE - DFHCSDUP INPUT                                *
*  (c) Copyright IBM Corp. 2026 All Rights Reserved                   *
*  US Government Users Restricted Rights - Use, duplication or        *
*  disclosure restricted by GSA ADP Schedule Contract with            *
*  IBM Corp                                                           *
*---------------------------------------------------------------------*
DEFINE FILE(£MPFILE1) GROUP(SMPFILEL)
DESCRIPTION(SAMPLE FILE DEFINITION)
       DSNAME(FINANCE.DATASET1.V1) RLSACCESS(YES) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES) 
DEFINE FILE(£MPFILE2) GROUP(SMPFILEL)
DESCRIPTION(SAMPLE FILE DEFINITION)
       DSNAME(FINANCE.DATASET2.V1) RLSACCESS(YES) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES) 
DEFINE FILE(£MPFILE3) GROUP(SMPFILEL)
DESCRIPTION(SAMPLE FILE DEFINITION)
       DSNAME(FINANCE.DATASET3.V1) RLSACCESS(YES) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES)
DEFINE FILE(#MPFILE1) GROUP(SMPFILEL)
DESCRIPTION(SAMPLE FILE DEFINITION)
       DSNAME(FINANCE.DATASET1.V2) RLSACCESS(YES) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES)
DEFINE FILE(#MPFILE2) GROUP(SMPFILEL)
DESCRIPTION(SAMPLE FILE DEFINITION)
       DSNAME(FINANCE.DATASET2.V2) RLSACCESS(YES) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES) 
DEFINE FILE(#MPFILE3) GROUP(SMPFILEL)
DESCRIPTION(SAMPLE FILE DEFINITION)
       DSNAME(FINANCE.DATASET3.V2) RLSACCESS(YES) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES) 
