*---------------------------------------------------------------------*
*  Licensed Materials - Property of IBM                               *
*  CICS XFCREQ SAMPLE - DFHCSDUP INPUT                                *
*  (c) Copyright IBM Corp. 2026 All Rights Reserved                   *
*  US Government Users Restricted Rights - Use, duplication or        *
*  disclosure restricted by GSA ADP Schedule Contract with            *
*  IBM Corp                                                           *
*---------------------------------------------------------------------*
DEFINE FILE(£MPFILE1) GROUP(SMPFILER) REMOTESYSTEM(<REMOTE SYSID>)
       REMOTENAME(£MPFILE1) 
DEFINE FILE(£MPFILE2) GROUP(SMPFILER) REMOTESYSTEM(<REMOTE SYSID>)
       REMOTENAME(£MPFILE2) 
DEFINE FILE(£MPFILE3) GROUP(SMPFILER) REMOTESYSTEM(<REMOTE SYSID>)
       REMOTENAME(£MPFILE3)
DEFINE FILE(#MPFILE1) GROUP(SMPFILER) REMOTESYSTEM(<REMOTE SYSID>)
       REMOTENAME(#MPFILE1) 
DEFINE FILE(#MPFILE2) GROUP(SMPFILER) REMOTESYSTEM(<REMOTE SYSID>)
       REMOTENAME(#MPFILE2) 
DEFINE FILE(#MPFILE3) GROUP(SMPFILER) REMOTESYSTEM(<REMOTE SYSID>)
       REMOTENAME(#MPFILE3) 
DEFINE PROGRAM(EXITMAIN) GROUP(SMPFILER)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) 
DEFINE PROGRAM(SMPFCREQ) GROUP(SMPFILER)
       LANGUAGE(ASSEMBLER) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) 
DEFINE TRANSACTION(MAIN) GROUP(SMPFILER)
       PROGRAM(EXITMAIN) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) 
