*---------------------------------------------------------------------*
*  Licensed Materials - Property of IBM                               *
*  CICS XFCREQ SAMPLE - DFHCSDUP INPUT                                *
*  (c) Copyright IBM Corp. 2026 All Rights Reserved                   *
*  US Government Users Restricted Rights - Use, duplication or        *
*  disclosure restricted by GSA ADP Schedule Contract with            *
*  IBM Corp                                                           *
*---------------------------------------------------------------------*
DEFINE FILE(£MPFILE1) GROUP(SMPFILER)
       RLSACCESS(NO) LSRPOOLNUM(1) READINTEG(UNCOMMITTED)
       DSNSHARING(ALLREQS) STRINGS(1) REMOTESYSTEM(EAD1)
       REMOTENAME(£MPFILE1) STATUS(ENABLED) OPENTIME(FIRSTREF)
       DISPOSITION(SHARE) DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO)
       MAXNUMRECS(NOLIMIT) UPDATEMODEL(LOCKING) LOAD(NO)
       RECORDFORMAT(V) ADD(NO) BROWSE(NO) DELETE(NO) READ(YES)
       UPDATE(NO) JOURNAL(NO) JNLREAD(NONE) JNLSYNCREAD(NO)
       JNLUPDATE(NO) JNLADD(NONE) JNLSYNCWRITE(YES) RECOVERY(NONE)
       FWDRECOVLOG(NO) BACKUPTYPE(STATIC) DEFINETIME(26/01/09 13:41:39)
       CHANGETIME(26/01/09 13:42:40) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE FILE(£MPFILE2) GROUP(SMPFILER)
       RLSACCESS(NO) LSRPOOLNUM(1) READINTEG(UNCOMMITTED)
       DSNSHARING(ALLREQS) STRINGS(1) REMOTESYSTEM(EAD1)
       REMOTENAME(£MPFILE2) STATUS(ENABLED) OPENTIME(FIRSTREF)
       DISPOSITION(SHARE) DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO)
       MAXNUMRECS(NOLIMIT) UPDATEMODEL(LOCKING) LOAD(NO)
       RECORDFORMAT(V) ADD(NO) BROWSE(NO) DELETE(NO) READ(YES)
       UPDATE(NO) JOURNAL(NO) JNLREAD(NONE) JNLSYNCREAD(NO)
       JNLUPDATE(NO) JNLADD(NONE) JNLSYNCWRITE(YES) RECOVERY(NONE)
       FWDRECOVLOG(NO) BACKUPTYPE(STATIC) DEFINETIME(26/01/09 13:42:52)
       CHANGETIME(26/01/09 13:42:52) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE FILE(£MPFILE3) GROUP(SMPFILER)
       RLSACCESS(NO) LSRPOOLNUM(1) READINTEG(UNCOMMITTED)
       DSNSHARING(ALLREQS) STRINGS(1) REMOTESYSTEM(EAD1)
       REMOTENAME(£MPFILE3) STATUS(ENABLED) OPENTIME(FIRSTREF)
       DISPOSITION(SHARE) DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO)
       MAXNUMRECS(NOLIMIT) UPDATEMODEL(LOCKING) LOAD(NO)
       RECORDFORMAT(V) ADD(NO) BROWSE(NO) DELETE(NO) READ(YES)
       UPDATE(NO) JOURNAL(NO) JNLREAD(NONE) JNLSYNCREAD(NO)
       JNLUPDATE(NO) JNLADD(NONE) JNLSYNCWRITE(YES) RECOVERY(NONE)
       FWDRECOVLOG(NO) BACKUPTYPE(STATIC) DEFINETIME(26/01/09 13:42:55)
       CHANGETIME(26/01/09 13:42:55) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE FILE(#MPFILE1) GROUP(SMPFILER)
       RLSACCESS(NO) LSRPOOLNUM(1) READINTEG(UNCOMMITTED)
       DSNSHARING(ALLREQS) STRINGS(1) REMOTESYSTEM(EAD1)
       REMOTENAME(#MPFILE1) STATUS(ENABLED) OPENTIME(FIRSTREF)
       DISPOSITION(SHARE) DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO)
       MAXNUMRECS(NOLIMIT) UPDATEMODEL(LOCKING) LOAD(NO)
       RECORDFORMAT(V) ADD(NO) BROWSE(NO) DELETE(NO) READ(YES)
       UPDATE(NO) JOURNAL(NO) JNLREAD(NONE) JNLSYNCREAD(NO)
       JNLUPDATE(NO) JNLADD(NONE) JNLSYNCWRITE(YES) RECOVERY(NONE)
       FWDRECOVLOG(NO) BACKUPTYPE(STATIC) DEFINETIME(26/01/09 13:43:14)
       CHANGETIME(26/01/09 13:43:14) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE FILE(#MPFILE2) GROUP(SMPFILER)
       RLSACCESS(NO) LSRPOOLNUM(1) READINTEG(UNCOMMITTED)
       DSNSHARING(ALLREQS) STRINGS(1) REMOTESYSTEM(EAD1)
       REMOTENAME(#MPFILE2) STATUS(ENABLED) OPENTIME(FIRSTREF)
       DISPOSITION(SHARE) DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO)
       MAXNUMRECS(NOLIMIT) UPDATEMODEL(LOCKING) LOAD(NO)
       RECORDFORMAT(V) ADD(NO) BROWSE(NO) DELETE(NO) READ(YES)
       UPDATE(NO) JOURNAL(NO) JNLREAD(NONE) JNLSYNCREAD(NO)
       JNLUPDATE(NO) JNLADD(NONE) JNLSYNCWRITE(YES) RECOVERY(NONE)
       FWDRECOVLOG(NO) BACKUPTYPE(STATIC) DEFINETIME(26/01/09 13:43:11)
       CHANGETIME(26/01/09 13:43:11) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE FILE(#MPFILE3) GROUP(SMPFILER)
       RLSACCESS(NO) LSRPOOLNUM(1) READINTEG(UNCOMMITTED)
       DSNSHARING(ALLREQS) STRINGS(1) REMOTESYSTEM(EAD1)
       REMOTENAME(#MPFILE3) STATUS(ENABLED) OPENTIME(FIRSTREF)
       DISPOSITION(SHARE) DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO)
       MAXNUMRECS(NOLIMIT) UPDATEMODEL(LOCKING) LOAD(NO)
       RECORDFORMAT(V) ADD(NO) BROWSE(NO) DELETE(NO) READ(YES)
       UPDATE(NO) JOURNAL(NO) JNLREAD(NONE) JNLSYNCREAD(NO)
       JNLUPDATE(NO) JNLADD(NONE) JNLSYNCWRITE(YES) RECOVERY(NONE)
       FWDRECOVLOG(NO) BACKUPTYPE(STATIC) DEFINETIME(26/01/09 13:43:07)
       CHANGETIME(26/01/09 13:43:07) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE PROGRAM(EXITMAIN) GROUP(SMPFILER)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(26/01/16 15:17:06)
       CHANGETIME(26/01/16 15:17:06) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE PROGRAM(SMPFCREQ) GROUP(SMPFILER)
       LANGUAGE(ASSEMBLER) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(26/01/16 15:17:06)
       CHANGETIME(26/01/16 15:17:06) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE PROGRAM(TWOFCREQ) GROUP(SMPFILER)
       LANGUAGE(ASSEMBLER) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(26/01/22 12:51:56)
       CHANGETIME(26/01/22 12:51:56) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE TRANSACTION(MAIN) GROUP(SMPFILER)
       PROGRAM(EXITMAIN) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)
       RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO) OTELPROP(PROPONLY)
       OTELEMIT(TASKEND) DEFINETIME(26/01/16 15:17:06)
       CHANGETIME(26/01/16 15:17:06) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
