*---------------------------------------------------------------------*
*  Licensed Materials - Property of IBM                               *
*  CICS XFCREQ SAMPLE - DFHCSDUP INPUT                                *
*  (c) Copyright IBM Corp. 2026 All Rights Reserved                   *
*  US Government Users Restricted Rights - Use, duplication or        *
*  disclosure restricted by GSA ADP Schedule Contract with            *
*  IBM Corp                                                           *
*---------------------------------------------------------------------*
DEFINE FILE(£MPFILE1) GROUP(SMPFILEL)
DESCRIPTION(SAMPLE FILE DEFINITION)
       DSNAME(FINANCE.DATASET1.V1) RLSACCESS(YES) LSRPOOLNUM(1)
       READINTEG(UNCOMMITTED) DSNSHARING(ALLREQS) STRINGS(1)
       STATUS(ENABLED) OPENTIME(FIRSTREF) DISPOSITION(SHARE)
       DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO) MAXNUMRECS(NOLIMIT)
       UPDATEMODEL(LOCKING) LOAD(NO) RECORDFORMAT(V) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES) JOURNAL(NO)
       JNLREAD(NONE) JNLSYNCREAD(NO) JNLUPDATE(NO) JNLADD(NONE)
       JNLSYNCWRITE(YES) RECOVERY(NONE) FWDRECOVLOG(NO)
       BACKUPTYPE(STATIC) DEFINETIME(26/01/09 13:38:51)
       CHANGETIME(26/01/09 13:39:48) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE FILE(£MPFILE2) GROUP(SMPFILEL)
DESCRIPTION(SAMPLE FILE DEFINITION)
       DSNAME(FINANCE.DATASET2.V1) RLSACCESS(YES) LSRPOOLNUM(1)
       READINTEG(UNCOMMITTED) DSNSHARING(ALLREQS) STRINGS(1)
       STATUS(ENABLED) OPENTIME(FIRSTREF) DISPOSITION(SHARE)
       DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO) MAXNUMRECS(NOLIMIT)
       UPDATEMODEL(LOCKING) LOAD(NO) RECORDFORMAT(V) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES) JOURNAL(NO)
       JNLREAD(NONE) JNLSYNCREAD(NO) JNLUPDATE(NO) JNLADD(NONE)
       JNLSYNCWRITE(YES) RECOVERY(NONE) FWDRECOVLOG(NO)
       BACKUPTYPE(STATIC) DEFINETIME(26/01/09 13:39:09)
       CHANGETIME(26/01/09 13:40:37) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE FILE(£MPFILE3) GROUP(SMPFILEL)
DESCRIPTION(SAMPLE FILE DEFINITION)
       DSNAME(FINANCE.DATASET3.V1) RLSACCESS(YES) LSRPOOLNUM(1)
       READINTEG(UNCOMMITTED) DSNSHARING(ALLREQS) STRINGS(1)
       STATUS(ENABLED) OPENTIME(FIRSTREF) DISPOSITION(SHARE)
       DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO) MAXNUMRECS(NOLIMIT)
       UPDATEMODEL(LOCKING) LOAD(NO) RECORDFORMAT(V) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES) JOURNAL(NO)
       JNLREAD(NONE) JNLSYNCREAD(NO) JNLUPDATE(NO) JNLADD(NONE)
       JNLSYNCWRITE(YES) RECOVERY(NONE) FWDRECOVLOG(NO)
       BACKUPTYPE(STATIC) DEFINETIME(26/01/09 13:39:12)
       CHANGETIME(26/01/09 13:40:08) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE FILE(#MPFILE1) GROUP(SMPFILEL)
DESCRIPTION(SAMPLE FILE DEFINITION)
       DSNAME(FINANCE.DATASET1.V2) RLSACCESS(YES) LSRPOOLNUM(1)
       READINTEG(UNCOMMITTED) DSNSHARING(ALLREQS) STRINGS(1)
       STATUS(ENABLED) OPENTIME(FIRSTREF) DISPOSITION(SHARE)
       DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO) MAXNUMRECS(NOLIMIT)
       UPDATEMODEL(LOCKING) LOAD(NO) RECORDFORMAT(V) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES) JOURNAL(NO)
       JNLREAD(NONE) JNLSYNCREAD(NO) JNLUPDATE(NO) JNLADD(NONE)
       JNLSYNCWRITE(YES) RECOVERY(NONE) FWDRECOVLOG(NO)
       BACKUPTYPE(STATIC) DEFINETIME(26/01/09 13:38:20)
       CHANGETIME(26/01/09 13:40:16) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE FILE(#MPFILE2) GROUP(SMPFILEL)
DESCRIPTION(SAMPLE FILE DEFINITION)
       DSNAME(FINANCE.DATASET2.V2) RLSACCESS(YES) LSRPOOLNUM(1)
       READINTEG(UNCOMMITTED) DSNSHARING(ALLREQS) STRINGS(1)
       STATUS(ENABLED) OPENTIME(FIRSTREF) DISPOSITION(SHARE)
       DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO) MAXNUMRECS(NOLIMIT)
       UPDATEMODEL(LOCKING) LOAD(NO) RECORDFORMAT(V) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES) JOURNAL(NO)
       JNLREAD(NONE) JNLSYNCREAD(NO) JNLUPDATE(NO) JNLADD(NONE)
       JNLSYNCWRITE(YES) RECOVERY(NONE) FWDRECOVLOG(NO)
       BACKUPTYPE(STATIC) DEFINETIME(26/01/09 13:39:29)
       CHANGETIME(26/01/09 13:40:22) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
DEFINE FILE(#MPFILE3) GROUP(SMPFILEL)
DESCRIPTION(SAMPLE FILE DEFINITION)
       DSNAME(FINANCE.DATASET3.V2) RLSACCESS(YES) LSRPOOLNUM(1)
       READINTEG(UNCOMMITTED) DSNSHARING(ALLREQS) STRINGS(1)
       STATUS(ENABLED) OPENTIME(FIRSTREF) DISPOSITION(SHARE)
       DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO) MAXNUMRECS(NOLIMIT)
       UPDATEMODEL(LOCKING) LOAD(NO) RECORDFORMAT(V) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES) JOURNAL(NO)
       JNLREAD(NONE) JNLSYNCREAD(NO) JNLUPDATE(NO) JNLADD(NONE)
       JNLSYNCWRITE(YES) RECOVERY(NONE) FWDRECOVLOG(NO)
       BACKUPTYPE(STATIC) DEFINETIME(26/01/09 13:39:26)
       CHANGETIME(26/01/09 13:40:27) CHANGEUSRID(GENAPP)
       CHANGEAGENT(CSDAPI) CHANGEAGREL(0740)
